# List Comprehensions
---
- **GÖREV 1**: List Comprehension yapısı kullanarak car_crashes verisindeki numeric değişkenlerin isimlerini büyük harfe çeviriniz ve başına NUM ekleyiniz.


- **Beklenen Çıktı**
- ['NUM_TOTAL',
-  'NUM_SPEEDING',
-  'NUM_ALCOHOL',
-  'NUM_NOT_DISTRACTED',
-  'NUM_NO_PREVIOUS',
-  'NUM_INS_PREMIUM',
-  'NUM_INS_LOSSES',
-  'ABBREV']


- Notlar:
    - Numerik olmayanların da isimleri büyümeli.
    - Tek bir list comp yapısı ile yapılmalı.

In [1]:
import seaborn as sns
import pandas as pd
pd.set_option("display.max_rows", None)
pd.set_option("display.max_columns", None)
pd.set_option("display.width", 500)

df = sns.load_dataset("car_crashes")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   total           51 non-null     float64
 1   speeding        51 non-null     float64
 2   alcohol         51 non-null     float64
 3   not_distracted  51 non-null     float64
 4   no_previous     51 non-null     float64
 5   ins_premium     51 non-null     float64
 6   ins_losses      51 non-null     float64
 7   abbrev          51 non-null     object
dtypes: float64(7), object(1)
memory usage: 3.3+ KB

In [2]:
["NUM_" + col.upper() if df[col].dtype != "O" else col.upper() for col in df.columns]

['NUM_TOTAL',
 'NUM_SPEEDING',
 'NUM_ALCOHOL',
 'NUM_NOT_DISTRACTED',
 'NUM_NO_PREVIOUS',
 'NUM_INS_PREMIUM',
 'NUM_INS_LOSSES',
 'ABBREV']

- **GÖREV 2**: List Comprehension yapısı kullanarak car_crashes verisindeki isminde "no" barındırmayan değişkenlerin isimlerininin sonuna "FLAG" yazınız.


- **Notlar**:
- Tüm değişken isimleri büyük olmalı.
- Tek bir list comp ile yapılmalı.


- _Beklenen çıktı_:


- ['TOTAL_FLAG',
- 'SPEEDING_FLAG',
-  'ALCOHOL_FLAG',
-  'NOT_DISTRACTED',
-  'NO_PREVIOUS',
-  'INS_PREMIUM_FLAG',
-  'INS_LOSSES_FLAG',
-  'ABBREV_FLAG']

In [3]:
[col.upper() if "no" in col else col.upper() + "_FLAG" for col in df.columns]

['TOTAL_FLAG',
 'SPEEDING_FLAG',
 'ALCOHOL_FLAG',
 'NOT_DISTRACTED',
 'NO_PREVIOUS',
 'INS_PREMIUM_FLAG',
 'INS_LOSSES_FLAG',
 'ABBREV_FLAG']

- **Görev 3**: List Comprehension yapısı kullanarak aşağıda verilen değişken isimlerinden FARKLI olan değişkenlerin isimlerini seçiniz ve yeni bir dataframe oluşturunuz.

- **Notlar**:
- Önce yukarıdaki listeye göre list comprehension kullanarak new_cols adında yeni liste oluşturunuz.
- Sonra df[new_cols] ile bu değişkenleri seçerek yeni bir df oluşturunuz adını new_df olarak isimlendiriniz.

In [4]:
og_list = ["abbrev", "no_previous"]

In [5]:
new_cols = [col for col in df.columns if col not in og_list]
df[new_cols].head()

   total  speeding  alcohol  not_distracted  ins_premium  ins_losses
0   18.8     7.332    5.640          18.048       784.55      145.08
1   18.1     7.421    4.525          16.290      1053.48      133.93
2   18.6     6.510    5.208          15.624       899.47      110.35
3   22.4     4.032    5.824          21.056       827.34      142.39
4   12.0     4.200    3.360          10.920       878.41      165.63

# Pandas Alıştırmalar
---
- **Görev 1**: Seaborn kütüphanesi içerisinden Titanic veri setini tanımlayınız.

In [6]:
df = sns.load_dataset("titanic")
df.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked  class    who  adult_male deck  embark_town alive  alone
0         0       3    male  22.0      1      0   7.2500        S  Third    man        True  NaN  Southampton    no  False
1         1       1  female  38.0      1      0  71.2833        C  First  woman       False    C    Cherbourg   yes  False
2         1       3  female  26.0      0      0   7.9250        S  Third  woman       False  NaN  Southampton   yes   True
3         1       1  female  35.0      1      0  53.1000        S  First  woman       False    C  Southampton   yes  False
4         0       3    male  35.0      0      0   8.0500        S  Third    man        True  NaN  Southampton    no   True

- **Görev 2**: Yukarıda tanımlanan Titanic veri setindeki kadın ve erkek yolcuların sayısını bulunuz.

In [7]:
df["sex"].value_counts()

male      577
female    314
Name: sex, dtype: int64

- **Görev 3**: Her bir sutuna ait unique değerlerin sayısını bulunuz.

In [8]:
df.nunique()

survived         2
pclass           3
sex              2
age             88
sibsp            7
parch            7
fare           248
embarked         3
class            3
who              3
adult_male       2
deck             7
embark_town      3
alive            2
alone            2
dtype: int64

- **Görev 4**: pclass değişkeninin unique değerleri bulunuz.

In [9]:
df["pclass"].unique()

array([3, 1, 2])

- **Görev 5**:  pclass ve parch değişkenlerinin unique değerlerinin sayısını bulunuz.

In [10]:
l = ["pclass", "parch"]
df[l].nunique()

pclass    3
parch     7
dtype: int64

- **Görev 6**: embarked değişkeninin tipini kontrol ediniz. Tipini category olarak değiştiriniz. Tekrar tipini kontrol ediniz.

In [11]:
df["embarked"].dtype

dtype('O')

In [12]:
str(df["embarked"].dtype)

'object'

In [13]:
df["embarked"] = df["embarked"].astype("category")

In [14]:
str(df["embarked"].dtype)

'category'

- **Görev 7**: embarked değeri C olanların tüm bilgelerini gösteriniz.

In [15]:
df[df["embarked"] == "C"].head(10)

    survived  pclass     sex   age  sibsp  parch      fare embarked   class    who  adult_male deck embark_town alive  alone
1          1       1  female  38.0      1      0   71.2833        C   First  woman       False    C   Cherbourg   yes  False
9          1       2  female  14.0      1      0   30.0708        C  Second  child       False  NaN   Cherbourg   yes  False
19         1       3  female   NaN      0      0    7.2250        C   Third  woman       False  NaN   Cherbourg   yes   True
26         0       3    male   NaN      0      0    7.2250        C   Third    man        True  NaN   Cherbourg    no   True
30         0       1    male  40.0      0      0   27.7208        C   First    man        True  NaN   Cherbourg    no   True
31         1       1  female   NaN      1      0  146.5208        C   First  woman       False    B   Cherbourg   yes  False
34         0       1    male  28.0      1      0   82.1708        C   First    man        True  NaN   Cherbourg    no  False
36         1       3    male   NaN      0      0    7.2292        C   Third    man        True  NaN   Cherbourg   yes   True
39         1       3  female  14.0      1      0   11.2417        C   Third  child       False  NaN   Cherbourg   yes  False
42         0       3    male   NaN      0      0    7.8958        C   Third    man        True  NaN   Cherbourg    no   True

- **Görev 8**: embarked değeri S olmayanların tüm bilgelerini gösteriniz.

In [16]:
df[df["embarked"] != "S"].info

<bound method DataFrame.info of      survived  pclass     sex    age  sibsp  parch      fare embarked   class    who  adult_male deck embark_town alive  alone
1           1       1  female  38.00      1      0   71.2833        C   First  woman       False    C   Cherbourg   yes  False
5           0       3    male    NaN      0      0    8.4583        Q   Third    man        True  NaN  Queenstown    no   True
9           1       2  female  14.00      1      0   30.0708        C  Second  child       False  NaN   Cherbourg   yes  False
16          0       3    male   2.00      4      1   29.1250        Q   Third  child       False  NaN  Queenstown    no  False
19          1       3  female    NaN      0      0    7.2250        C   Third  woman       False  NaN   Cherbourg   yes   True
22          1       3  female  15.00      0      0    8.0292        Q   Third  child       False  NaN  Queenstown   yes   True
26          0       3    male    NaN      0      0    7.2250        C   Third    man        True  NaN   Cherbourg    no   True
28          1       3  female    NaN      0      0    7.8792        Q   Third  woman       False  NaN  Queenstown   yes   True
30          0       1    male  40.00      0      0   27.7208        C   First    man        True  NaN   Cherbourg    no   True
31          1       1  female    NaN      1      0  146.5208        C   First  woman       False    B   Cherbourg   yes  False
32          1       3  female    NaN      0      0    7.7500        Q   Third  woman       False  NaN  Queenstown   yes   True
34          0       1    male  28.00      1      0   82.1708        C   First    man        True  NaN   Cherbourg    no  False
36          1       3    male    NaN      0      0    7.2292        C   Third    man        True  NaN   Cherbourg   yes   True
39          1       3  female  14.00      1      0   11.2417        C   Third  child       False  NaN   Cherbourg   yes  False
42          0       3    male    NaN      0      0    7.8958        C   Third    man        True  NaN   Cherbourg    no   True
43          1       2  female   3.00      1      2   41.5792        C  Second  child       False  NaN   Cherbourg   yes  False
44          1       3  female  19.00      0      0    7.8792        Q   Third  woman       False  NaN  Queenstown   yes   True
46          0       3    male    NaN      1      0   15.5000        Q   Third    man        True  NaN  Queenstown    no  False
47          1       3  female    NaN      0      0    7.7500        Q   Third  woman       False  NaN  Queenstown   yes   True
48          0       3    male    NaN      2      0   21.6792        C   Third    man        True  NaN   Cherbourg    no  False
52          1       1  female  49.00      1      0   76.7292        C   First  woman       False    D   Cherbourg   yes  False
54          0       1    male  65.00      0      1   61.9792        C   First    man        True    B   Cherbourg    no  False
57          0       3    male  28.50      0      0    7.2292        C   Third    man        True  NaN   Cherbourg    no   True
60          0       3    male  22.00      0      0    7.2292        C   Third    man        True  NaN   Cherbourg    no   True
61          1       1  female  38.00      0      0   80.0000      NaN   First  woman       False    B         NaN   yes   True
64          0       1    male    NaN      0      0   27.7208        C   First    man        True  NaN   Cherbourg    no   True
65          1       3    male    NaN      1      1   15.2458        C   Third    man        True  NaN   Cherbourg   yes  False
73          0       3    male  26.00      1      0   14.4542        C   Third    man        True  NaN   Cherbourg    no  False
82          1       3  female    NaN      0      0    7.7875        Q   Third  woman       False  NaN  Queenstown   yes   True
96          0       1    male  71.00      0      0   34.6542        C   First    man        True    A   Cherbourg    no   True
97          1       1    male  23.00      0      1   63.3583        C   First    man        True    D   Cherbourg   yes  False
109         1       3  female    NaN      1      0   24.1500        Q   Third  woman       False  NaN  Queenstown   yes  False
111         0       3  female  14.50      1      0   14.4542        C   Third  child       False  NaN   Cherbourg    no  False
114         0       3  female  17.00      0      0   14.4583        C   Third  woman       False  NaN   Cherbourg    no   True
116         0       3    male  70.50      0      0    7.7500        Q   Third    man        True  NaN  Queenstown    no   True
118         0       1    male  24.00      0      1  247.5208        C   First    man        True    B   Cherbourg    no  False
122         0       2    male  32.50      1      0   30.0708        C  Second    man        True  NaN   Cherbourg    no  False
125         1       3    male  12.00      1      0   11.2417        C   Third  child       False  NaN   Cherbourg   yes  False
126         0       3    male    NaN      0      0    7.7500        Q   Third    man        True  NaN  Queenstown    no   True
128         1       3  female    NaN      1      1   22.3583        C   Third  woman       False    F   Cherbourg   yes  False
130         0       3    male  33.00      0      0    7.8958        C   Third    man        True  NaN   Cherbourg    no   True
135         0       2    male  23.00      0      0   15.0458        C  Second    man        True  NaN   Cherbourg    no   True
139         0       1    male  24.00      0      0   79.2000        C   First    man        True    B   Cherbourg    no   True
140         0       3  female    NaN      0      2   15.2458        C   Third  woman       False  NaN   Cherbourg    no  False
143         0       3    male  19.00      0      0    6.7500        Q   Third    man        True  NaN  Queenstown    no   True
155         0       1    male  51.00      0      1   61.3792        C   First    man        True  NaN   Cherbourg    no  False
156         1       3  female  16.00      0      0    7.7333        Q   Third  woman       False  NaN  Queenstown   yes   True
171         0       3    male   4.00      4      1   29.1250        Q   Third  child       False  NaN  Queenstown    no  False
174         0       1    male  56.00      0      0   30.6958        C   First    man        True    A   Cherbourg    no   True
177         0       1  female  50.00      0      0   28.7125        C   First  woman       False    C   Cherbourg    no   True
181         0       2    male    NaN      0      0   15.0500        C  Second    man        True  NaN   Cherbourg    no   True
186         1       3  female    NaN      1      0   15.5000        Q   Third  woman       False  NaN  Queenstown   yes  False
188         0       3    male  40.00      1      1   15.5000        Q   Third    man        True  NaN  Queenstown    no  False
194         1       1  female  44.00      0      0   27.7208        C   First  woman       False    B   Cherbourg   yes   True
195         1       1  female  58.00      0      0  146.5208        C   First  woman       False    B   Cherbourg   yes   True
196         0       3    male    NaN      0      0    7.7500        Q   Third    man        True  NaN  Queenstown    no   True
198         1       3  female    NaN      0      0    7.7500        Q   Third  woman       False  NaN  Queenstown   yes   True
203         0       3    male  45.50      0      0    7.2250        C   Third    man        True  NaN   Cherbourg    no   True
207         1       3    male  26.00      0      0   18.7875        C   Third    man        True  NaN   Cherbourg   yes   True
208         1       3  female  16.00      0      0    7.7500        Q   Third  woman       False  NaN  Queenstown   yes   True
209         1       1    male  40.00      0      0   31.0000        C   First    man        True    A   Cherbourg   yes   True
214         0       3    male    NaN      1      0    7.7500        Q   Third    man        True  NaN  Queenstown    no  False
215         1       1  female  31.00      1      0  113.2750        C   First  woman       False    D   Cherbourg   yes  False
218         1       1  female  32.00      0      0   76.2917        C   First  woman       False    D   Cherbourg   yes   True
240         0       3  female    NaN      1      0   14.4542        C   Third  woman       False  NaN   Cherbourg    no  False
241         1       3  female    NaN      1      0   15.5000        Q   Third  woman       False  NaN  Queenstown   yes  False
244         0       3    male  30.00      0      0    7.2250        C   Third    man        True  NaN   Cherbourg    no   True
245         0       1    male  44.00      2      0   90.0000        Q   First    man        True    C  Queenstown    no  False
255         1       3  female  29.00      0      2   15.2458        C   Third  woman       False  NaN   Cherbourg   yes  False
256         1       1  female    NaN      0      0   79.2000        C   First  woman       False  NaN   Cherbourg   yes   True
258         1       1  female  35.00      0      0  512.3292        C   First  woman       False  NaN   Cherbourg   yes   True
260         0       3    male    NaN      0      0    7.7500        Q   Third    man        True  NaN  Queenstown    no   True
264         0       3  female    NaN      0      0    7.7500        Q   Third  woman       False  NaN  Queenstown    no   True
273         0       1    male  37.00      0      1   29.7000        C   First    man        True    C   Cherbourg    no  False
274         1       3  female    NaN      0      0    7.7500        Q   Third  woman       False  NaN  Queenstown   yes   True
278         0       3    male   7.00      4      1   29.1250        Q   Third  child       False  NaN  Queenstown    no  False
280         0       3    male  65.00      0      0    7.7500        Q   Third    man        True  NaN  Queenstown    no   True
285         0       3    male  33.00      0      0    8.6625        C   Third    man        True  NaN   Cherbourg    no   True
289         1       3  female  22.00      0      0    7.7500        Q   Third  woman       False  NaN  Queenstown   yes   True
291         1       1  female  19.00      1      0   91.0792        C   First  woman       False    B   Cherbourg   yes  False
292         0       2    male  36.00      0      0   12.8750        C  Second    man        True    D   Cherbourg    no   True
295         0       1    male    NaN      0      0   27.7208        C   First    man        True  NaN   Cherbourg    no   True
296         0       3    male  23.50      0      0    7.2292        C   Third    man        True  NaN   Cherbourg    no   True
299         1       1  female  50.00      0      1  247.5208        C   First  woman       False    B   Cherbourg   yes  False
300         1       3  female    NaN      0      0    7.7500        Q   Third  woman       False  NaN  Queenstown   yes   True
301         1       3    male    NaN      2      0   23.2500        Q   Third    man        True  NaN  Queenstown   yes  False
303         1       2  female    NaN      0      0   12.3500        Q  Second  woman       False    E  Queenstown   yes   True
306         1       1  female    NaN      0      0  110.8833        C   First  woman       False  NaN   Cherbourg   yes   True
307         1       1  female  17.00      1      0  108.9000        C   First  woman       False    C   Cherbourg   yes  False
308         0       2    male  30.00      1      0   24.0000        C  Second    man        True  NaN   Cherbourg    no  False
309         1       1  female  30.00      0      0   56.9292        C   First  woman       False    E   Cherbourg   yes   True
310         1       1  female  24.00      0      0   83.1583        C   First  woman       False    C   Cherbourg   yes   True
311         1       1  female  18.00      2      2  262.3750        C   First  woman       False    B   Cherbourg   yes  False
319         1       1  female  40.00      1      1  134.5000        C   First  woman       False    E   Cherbourg   yes  False
322         1       2  female  30.00      0      0   12.3500        Q  Second  woman       False  NaN  Queenstown   yes   True
325         1       1  female  36.00      0      0  135.6333        C   First  woman       False    C   Cherbourg   yes   True
329         1       1  female  16.00      0      1   57.9792        C   First  woman       False    B   Cherbourg   yes  False
330         1       3  female    NaN      2      0   23.2500        Q   Third  woman       False  NaN  Queenstown   yes  False
337         1       1  female  41.00      0      0  134.5000        C   First  woman       False    E   Cherbourg   yes   True
352         0       3    male  15.00      1      1    7.2292        C   Third  child       False  NaN   Cherbourg    no  False
354         0       3    male    NaN      0      0    7.2250        C   Third    man        True  NaN   Cherbourg    no   True
358         1       3  female    NaN      0      0    7.8792        Q   Third  woman       False  NaN  Queenstown   yes   True
359         1       3  female    NaN      0      0    7.8792        Q   Third  woman       False  NaN  Queenstown   yes   True
361         0       2    male  29.00      1      0   27.7208        C  Second    man        True  NaN   Cherbourg    no  False
362         0       3  female  45.00      0      1   14.4542        C   Third  woman       False  NaN   Cherbourg    no  False
364         0       3    male    NaN      1      0   15.5000        Q   Third    man        True  NaN  Queenstown    no  False
366         1       1  female  60.00      1      0   75.2500        C   First  woman       False    D   Cherbourg   yes  False
367         1       3  female    NaN      0      0    7.2292        C   Third  woman       False  NaN   Cherbourg   yes   True
368         1       3  female    NaN      0      0    7.7500        Q   Third  woman       False  NaN  Queenstown   yes   True
369         1       1  female  24.00      0      0   69.3000        C   First  woman       False    B   Cherbourg   yes   True
370         1       1    male  25.00      1      0   55.4417        C   First    man        True    E   Cherbourg   yes  False
373         0       1    male  22.00      0      0  135.6333        C   First    man        True  NaN   Cherbourg    no   True
375         1       1  female    NaN      1      0   82.1708        C   First  woman       False  NaN   Cherbourg   yes  False
377         0       1    male  27.00      0      2  211.5000        C   First    man        True    C   Cherbourg    no  False
378         0       3    male  20.00      0      0    4.0125        C   Third    man        True  NaN   Cherbourg    no   True
380         1       1  female  42.00      0      0  227.5250        C   First  woman       False  NaN   Cherbourg   yes   True
381         1       3  female   1.00      0      2   15.7417        C   Third  child       False  NaN   Cherbourg   yes  False
388         0       3    male    NaN      0      0    7.7292        Q   Third    man        True  NaN  Queenstown    no   True
389         1       2  female  17.00      0      0   12.0000        C  Second  woman       False  NaN   Cherbourg   yes   True
393         1       1  female  23.00      1      0  113.2750        C   First  woman       False    D   Cherbourg   yes  False
411         0       3    male    NaN      0      0    6.8583        Q   Third    man        True  NaN  Queenstown    no   True
412         1       1  female  33.00      1      0   90.0000        Q   First  woman       False    C  Queenstown   yes  False
420         0       3    male    NaN      0      0    7.8958        C   Third    man        True  NaN   Cherbourg    no   True
421         0       3    male  21.00      0      0    7.7333        Q   Third    man        True  NaN  Queenstown    no   True
428         0       3    male    NaN      0      0    7.7500        Q   Third    man        True  NaN  Queenstown    no   True
448         1       3  female   5.00      2      1   19.2583        C   Third  child       False  NaN   Cherbourg   yes  False
452         0       1    male  30.00      0      0   27.7500        C   First    man        True    C   Cherbourg    no   True
453         1       1    male  49.00      1      0   89.1042        C   First    man        True    C   Cherbourg   yes  False
455         1       3    male  29.00      0      0    7.8958        C   Third    man        True  NaN   Cherbourg   yes   True
459         0       3    male    NaN      0      0    7.7500        Q   Third    man        True  NaN  Queenstown    no   True
468         0       3    male    NaN      0      0    7.7250        Q   Third    man        True  NaN  Queenstown    no   True
469         1       3  female   0.75      2      1   19.2583        C   Third  child       False  NaN   Cherbourg   yes  False
473         1       2  female  23.00      0      0   13.7917        C  Second  woman       False    D   Cherbourg   yes   True
484         1       1    male  25.00      1      0   91.0792        C   First    man        True    B   Cherbourg   yes  False
487         0       1    male  58.00      0      0   29.7000        C   First    man        True    B   Cherbourg    no   True
493         0       1    male  71.00      0      0   49.5042        C   First    man        True  NaN   Cherbourg    no   True
495         0       3    male    NaN      0      0   14.4583        C   Third    man        True  NaN   Cherbourg    no   True
496         1       1  female  54.00      1      0   78.2667        C   First  woman       False    D   Cherbourg   yes  False
501         0       3  female  21.00      0      0    7.7500        Q   Third  woman       False  NaN  Queenstown    no   True
502         0       3  female    NaN      0      0    7.6292        Q   Third  woman       False  NaN  Queenstown    no   True
505         0       1    male  18.00      1      0  108.9000        C   First    man        True    C   Cherbourg    no  False
510         1       3    male  29.00      0      0    7.7500        Q   Third    man        True  NaN  Queenstown   yes   True
513         1       1  female  54.00      1      0   59.4000        C   First  woman       False  NaN   Cherbourg   yes  False
517         0       3    male    NaN      0      0   24.1500        Q   Third    man        True  NaN  Queenstown    no   True
522         0       3    male    NaN      0      0    7.2250        C   Third    man        True  NaN   Cherbourg    no   True
523         1       1  female  44.00      0      1   57.9792        C   First  woman       False    B   Cherbourg   yes  False
524         0       3    male    NaN      0      0    7.2292        C   Third    man        True  NaN   Cherbourg    no   True
525         0       3    male  40.50      0      0    7.7500        Q   Third    man        True  NaN  Queenstown    no   True
531         0       3    male    NaN      0      0    7.2292        C   Third    man        True  NaN   Cherbourg    no   True
532         0       3    male  17.00      1      1    7.2292        C   Third    man        True  NaN   Cherbourg    no  False
533         1       3  female    NaN      0      2   22.3583        C   Third  woman       False  NaN   Cherbourg   yes  False
537         1       1  female  30.00      0      0  106.4250        C   First  woman       False  NaN   Cherbourg   yes   True
539         1       1  female  22.00      0      2   49.5000        C   First  woman       False    B   Cherbourg   yes  False
544         0       1    male  50.00      1      0  106.4250        C   First    man        True    C   Cherbourg    no  False
547         1       2    male    NaN      0      0   13.8625        C  Second    man        True  NaN   Cherbourg   yes   True
550         1       1    male  17.00      0      2  110.8833        C   First    man        True    C   Cherbourg   yes  False

- **Görev 9**: Yaşı 30 dan küçük ve kadın olan yolcuların tüm bilgilerini gösteriniz.

In [17]:
df[(df["age"] < 30) & (df["sex"] == "female")].head()

    survived  pclass     sex   age  sibsp  parch     fare embarked   class    who  adult_male deck  embark_town alive  alone
2          1       3  female  26.0      0      0   7.9250        S   Third  woman       False  NaN  Southampton   yes   True
8          1       3  female  27.0      0      2  11.1333        S   Third  woman       False  NaN  Southampton   yes  False
9          1       2  female  14.0      1      0  30.0708        C  Second  child       False  NaN    Cherbourg   yes  False
10         1       3  female   4.0      1      1  16.7000        S   Third  child       False    G  Southampton   yes  False
14         0       3  female  14.0      0      0   7.8542        S   Third  child       False  NaN  Southampton    no   True

- **Görev 10**: Fare'i 500'den büyük veya yaşı 70 den büyük yolcuların bilgilerini gösteriniz.

In [18]:
df[(df["fare"] > 500) | (df["age"] > 70)].head()

     survived  pclass     sex   age  sibsp  parch      fare embarked  class    who  adult_male deck  embark_town alive  alone
96          0       1    male  71.0      0      0   34.6542        C  First    man        True    A    Cherbourg    no   True
116         0       3    male  70.5      0      0    7.7500        Q  Third    man        True  NaN   Queenstown    no   True
258         1       1  female  35.0      0      0  512.3292        C  First  woman       False  NaN    Cherbourg   yes   True
493         0       1    male  71.0      0      0   49.5042        C  First    man        True  NaN    Cherbourg    no   True
630         1       1    male  80.0      0      0   30.0000        S  First    man        True    A  Southampton   yes   True

- **Görev 11**: Her bir değişkendeki boş değerlerin toplamını bulunuz.

In [19]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

- **Görev 12**: who değişkenini dataframe'den düşürün.

In [20]:
df.drop("who", axis=1, inplace=True)

- **Görev 13**: deck değikenindeki boş değerleri deck değişkenin en çok tekrar eden değeri (mode) ile doldurunuz.

In [21]:
type(df["deck"].mode())

pandas.core.series.Series

In [22]:
df["deck"].mode()[0]

'C'

In [23]:
df["deck"].fillna(df["deck"].mode()[0], inplace=True)

In [24]:
df["deck"].isnull().sum()

0

- **Görev 14**: age değikenindeki boş değerleri age değişkenin medyanı ile doldurun.

In [25]:
df["age"].isnull().sum()

177

In [26]:
df["age"].fillna(df["age"].median(), inplace=True)

In [27]:
df["age"].isnull().sum()

0

- **Görev 15**: survived değişkeninin Pclass ve Cinsiyet değişkenleri kırılımınında sum, count, mean değerlerini bulunuz.

In [28]:
df.groupby(["pclass", "sex"]).agg({"survived": ["sum", "count", "mean"]})

              survived
                   sum count      mean
pclass sex
1      female       91    94  0.968085
       male         45   122  0.368852
2      female       70    76  0.921053
       male         17   108  0.157407
3      female       72   144  0.500000
       male         47   347  0.135447

- **Görev 16**:  30 yaşın altında olanlar 1, 30'a eşit ve üstünde olanlara 0 vericek bir fonksiyon yazınız.
- Yazdığınız fonksiyonu kullanarak titanik veri setinde age_flag adında bir değişken oluşturunuz oluşturunuz. (apply ve lambda yapılarını kullanınız)

In [30]:
def age(age):
    if age < 30:
        return 1
    else:
        return 0

In [31]:
df["age_flag"] = df["age"].apply(lambda x: age(x))

In [32]:
df["age_flag"] = df["age"].apply(lambda x: 1 if x < 30 else 0)

- **Görev 17**: Seaborn kütüphanesi içerisinden Tips veri setini tanımlayınız.

In [33]:
dff = sns.load_dataset("tips")
dff.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

- **Görev 18**: Time değişkeninin kategorilerine (Dinner, Lunch) göre total_bill  değerlerinin toplamını, min, max ve ortalamasını bulunuz.

In [34]:
dff.groupby("time").agg({"total_bill": ["sum", "min", "max", "mean"]})

       total_bill
              sum   min    max       mean
time
Lunch     1167.47  7.51  43.11  17.168676
Dinner    3660.30  3.07  50.81  20.797159

- **Görev 19**: Günlere ve time göre total_bill değerlerinin toplamını, min, max ve ortalamasını bulunuz.

In [35]:
dff.groupby(["day", "time"]).agg({"total_bill": ["sum", "min", "max", "mean"]})

            total_bill
                   sum    min    max       mean
day  time
Thur Lunch     1077.55   7.51  43.11  17.664754
     Dinner      18.78  18.78  18.78  18.780000
Fri  Lunch       89.92   8.58  16.27  12.845714
     Dinner     235.96   5.75  40.17  19.663333
Sat  Lunch        0.00    NaN    NaN        NaN
     Dinner    1778.40   3.07  50.81  20.441379
Sun  Lunch        0.00    NaN    NaN        NaN
     Dinner    1627.16   7.25  48.17  21.410000

- **Görev 20**:Lunch zamanına ve kadın müşterilere ait total_bill ve tip  değerlerinin day'e göre toplamını, min, max ve ortalamasını bulunuz.

In [36]:
dff[(dff["time"] == "Lunch") & (dff["sex"] == "Female")].groupby("day").agg({"total_bill": ["sum","min","max","mean"],
                                                                           "tip":  ["sum","min","max","mean"]})

     total_bill                            tip
            sum    min    max      mean    sum   min   max      mean
day
Thur     516.11   8.35  43.11  16.64871  79.42  1.25  5.17  2.561935
Fri       55.76  10.09  16.27  13.94000  10.98  2.00  3.48  2.745000
Sat        0.00    NaN    NaN       NaN   0.00   NaN   NaN       NaN
Sun        0.00    NaN    NaN       NaN   0.00   NaN   NaN       NaN

- **Görev 21**: size'i 3'ten küçük, total_bill'i 10'dan büyük olan siparişlerin ortalaması nedir?

In [37]:
dff[(dff["size"] < 3) & (dff["total_bill"] > 10)].mean()

/var/folders/j8/90mmwg5s5gv830l66qr9pvdm0000gn/T/ipykernel_6561/3874821502.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  dff[(dff["size"] < 3) & (dff["total_bill"] > 10)].mean()

total_bill    17.184965
tip            2.638811
size           1.993007
dtype: float64

- **Görev 22**: total_bill_tip_sum adında yeni bir değişken oluşturun. Her bir müşterinin ödediği totalbill ve tip in toplamını versin.

In [38]:
dff["total_bill_tip_sum"] = dff["total_bill"] + dff["tip"]
dff.head()

   total_bill   tip     sex smoker  day    time  size  total_bill_tip_sum
0       16.99  1.01  Female     No  Sun  Dinner     2               18.00
1       10.34  1.66    Male     No  Sun  Dinner     3               12.00
2       21.01  3.50    Male     No  Sun  Dinner     3               24.51
3       23.68  3.31    Male     No  Sun  Dinner     2               26.99
4       24.59  3.61  Female     No  Sun  Dinner     4               28.20

- **Görev 23**: total_bill_tip_sum değişkenine göre büyükten küçüğe sıralayınız ve ilk 30 kişiyi yeni bir dataframe'e atayınız.

In [39]:
femaleAvg = dff[dff["sex"] == "Female"]["total_bill"].mean()
maleAvg = dff[dff["sex"] == "Male"]["total_bill"].mean()

def avgFunc(sex,total_bill):
    if sex == "Female":
        if total_bill < femaleAvg:
            return 0
        else:
            return 1
    else:
        if total_bill < maleAvg:
            return 0
        else:
            return 1

dff["total_bill_flag"] = dff[["sex","total_bill"]].apply(lambda x: avgFunc(x["sex"],x["total_bill"]),axis=1)